data/attachments/518b1213474af2e9.txt

INFO     root:api_helper.py:33 Пользователь Michael Prince зарегистрирован
INFO     root:api_helper.py:33 Пользователь Mr. Edwin Jones DDS зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "398"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael Prince</nif:username>
            <nif:friendToBeRequested>Mr. Edwin Jones DDS</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "423",
  "Date": "Mon, 23 Jun 2025 03:58:30 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>d074ce93-0940-4a0e-9278-c8e59477cf9c</ns2:id><ns2:username>Mr. Edwin Jones DDS</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'


INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "394"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Mr. Edwin Jones DDS</nif:username>
            <nif:friendToBeAdded>Michael Prince</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "413",
  "Date": "Mon, 23 Jun 2025 03:58:30 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>91ffc996-bc45-4727-b8d2-c0d8d8ebb59b</ns2:id><ns2:username>Michael Prince</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>FRIEND</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'